grevaillot/svd_tools/headers/ATSAM4SP32A/adc.h
#pragma once 

/* --- ADC: Analog-to-Digital Converter ----------------------------- */

/** @defgroup adc_registers Analog-to-Digital Converter Register
@{*/

/** ADC_CR Control Register **/
#define ADC_CR			MMIO32(ADC_BASE + 0x00)
/** ADC_MR Mode Register **/
#define ADC_MR			MMIO32(ADC_BASE + 0x04)
/** ADC_SEQR1 Channel Sequence Register 1 **/
#define ADC_SEQR1			MMIO32(ADC_BASE + 0x08)
/** ADC_SEQR2 Channel Sequence Register 2 **/
#define ADC_SEQR2			MMIO32(ADC_BASE + 0x0c)
/** ADC_CHER Channel Enable Register **/
#define ADC_CHER			MMIO32(ADC_BASE + 0x10)
/** ADC_CHDR Channel Disable Register **/
#define ADC_CHDR			MMIO32(ADC_BASE + 0x14)
/** ADC_CHSR Channel Status Register **/
#define ADC_CHSR			MMIO32(ADC_BASE + 0x18)
/** ADC_LCDR Last Converted Data Register **/
#define ADC_LCDR			MMIO32(ADC_BASE + 0x20)
/** ADC_IER Interrupt Enable Register **/
#define ADC_IER			MMIO32(ADC_BASE + 0x24)
/** ADC_IDR Interrupt Disable Register **/
#define ADC_IDR			MMIO32(ADC_BASE + 0x28)
/** ADC_IMR Interrupt Mask Register **/
#define ADC_IMR			MMIO32(ADC_BASE + 0x2c)
/** ADC_ISR Interrupt Status Register **/
#define ADC_ISR			MMIO32(ADC_BASE + 0x30)
/** ADC_OVER Overrun Status Register **/
#define ADC_OVER			MMIO32(ADC_BASE + 0x3c)
/** ADC_EMR Extended Mode Register **/
#define ADC_EMR			MMIO32(ADC_BASE + 0x40)
/** ADC_CWR Compare Window Register **/
#define ADC_CWR			MMIO32(ADC_BASE + 0x44)
/** ADC_CGR Channel Gain Register **/
#define ADC_CGR			MMIO32(ADC_BASE + 0x48)
/** ADC_COR Channel Offset Register **/
#define ADC_COR			MMIO32(ADC_BASE + 0x4c)
/** ADC_CDR[0] Channel Data Register **/
#define ADC_CDR[0]			MMIO32(ADC_BASE + 0x50)
/** ADC_CDR[1] Channel Data Register **/
#define ADC_CDR[1]			MMIO32(ADC_BASE + 0x54)
/** ADC_CDR[2] Channel Data Register **/
#define ADC_CDR[2]			MMIO32(ADC_BASE + 0x58)
/** ADC_CDR[3] Channel Data Register **/
#define ADC_CDR[3]			MMIO32(ADC_BASE + 0x5c)
/** ADC_CDR[4] Channel Data Register **/
#define ADC_CDR[4]			MMIO32(ADC_BASE + 0x60)
/** ADC_CDR[5] Channel Data Register **/
#define ADC_CDR[5]			MMIO32(ADC_BASE + 0x64)
/** ADC_CDR[6] Channel Data Register **/
#define ADC_CDR[6]			MMIO32(ADC_BASE + 0x68)
/** ADC_CDR[7] Channel Data Register **/
#define ADC_CDR[7]			MMIO32(ADC_BASE + 0x6c)
/** ADC_CDR[8] Channel Data Register **/
#define ADC_CDR[8]			MMIO32(ADC_BASE + 0x70)
/** ADC_CDR[9] Channel Data Register **/
#define ADC_CDR[9]			MMIO32(ADC_BASE + 0x74)
/** ADC_ACR Analog Control Register **/
#define ADC_ACR			MMIO32(ADC_BASE + 0x94)
/** ADC_WPMR Write Protect Mode Register **/
#define ADC_WPMR			MMIO32(ADC_BASE + 0xe4)
/** ADC_WPSR Write Protect Status Register **/
#define ADC_WPSR			MMIO32(ADC_BASE + 0xe8)
/** ADC_RPR Receive Pointer Register **/
#define ADC_RPR			MMIO32(ADC_BASE + 0x100)
/** ADC_RCR Receive Counter Register **/
#define ADC_RCR			MMIO32(ADC_BASE + 0x104)
/** ADC_RNPR Receive Next Pointer Register **/
#define ADC_RNPR			MMIO32(ADC_BASE + 0x110)
/** ADC_RNCR Receive Next Counter Register **/
#define ADC_RNCR			MMIO32(ADC_BASE + 0x114)
/** ADC_PTCR Transfer Control Register **/
#define ADC_PTCR			MMIO32(ADC_BASE + 0x120)
/** ADC_PTSR Transfer Status Register **/
#define ADC_PTSR			MMIO32(ADC_BASE + 0x124)

/**@}*/


/** @defgroup adc_cr CR Control Register
@{*/

/** ADC_CR_AUTOCAL Automatic Calibration of ADC **/
#define ADC_CR_AUTOCAL		(1 << 3)
/** ADC_CR_START Start Conversion **/
#define ADC_CR_START		(1 << 1)
/** ADC_CR_SWRST Software Reset **/
#define ADC_CR_SWRST		(1 << 0)

/**@}*/

/** @defgroup adc_mr MR Mode Register
@{*/

/** ADC_MR_USEQ Use Sequence Enable **/
#define ADC_MR_USEQ		(1 << 31)

#define ADC_MR_TRANSFER_SHIFT		28
#define ADC_MR_TRANSFER_MASK		0x03
/** @defgroup adc_mr_transfer TRANSFER Transfer Period
@{*/
/**@}*/


#define ADC_MR_TRACKTIM_SHIFT		24
#define ADC_MR_TRACKTIM_MASK		0x0f
/** @defgroup adc_mr_tracktim TRACKTIM Tracking Time
@{*/
/**@}*/

/** ADC_MR_ANACH Analog Change **/
#define ADC_MR_ANACH		(1 << 23)

#define ADC_MR_SETTLING_SHIFT		20
#define ADC_MR_SETTLING_MASK		0x03
/** @defgroup adc_mr_settling SETTLING Analog Settling Time
@{*/
/**@}*/


#define ADC_MR_STARTUP_SHIFT		16
#define ADC_MR_STARTUP_MASK		0x0f
/** @defgroup adc_mr_startup STARTUP Start Up Time
@{*/
/**@}*/


#define ADC_MR_PRESCAL_SHIFT		8
#define ADC_MR_PRESCAL_MASK		0xff
/** @defgroup adc_mr_prescal PRESCAL Prescaler Rate Selection
@{*/
/**@}*/

/** ADC_MR_FREERUN Free Run Mode **/
#define ADC_MR_FREERUN		(1 << 7)
/** ADC_MR_FWUP Fast Wake Up **/
#define ADC_MR_FWUP		(1 << 6)
/** ADC_MR_SLEEP Sleep Mode **/
#define ADC_MR_SLEEP		(1 << 5)
/** ADC_MR_LOWRES Resolution **/
#define ADC_MR_LOWRES		(1 << 4)

#define ADC_MR_TRGSEL_SHIFT		1
#define ADC_MR_TRGSEL_MASK		0x07
/** @defgroup adc_mr_trgsel TRGSEL Trigger Selection
@{*/
/**@}*/

/** ADC_MR_TRGEN Trigger Enable **/
#define ADC_MR_TRGEN		(1 << 0)

/**@}*/

/** @defgroup adc_seqr1 SEQR1 Channel Sequence Register 1
@{*/


#define ADC_SEQR1_USCH8_SHIFT		28
#define ADC_SEQR1_USCH8_MASK		0x07
/** @defgroup adc_seqr1_usch8 USCH8 User Sequence Number 8
@{*/
/**@}*/


#define ADC_SEQR1_USCH7_SHIFT		24
#define ADC_SEQR1_USCH7_MASK		0x07
/** @defgroup adc_seqr1_usch7 USCH7 User Sequence Number 7
@{*/
/**@}*/


#define ADC_SEQR1_USCH6_SHIFT		20
#define ADC_SEQR1_USCH6_MASK		0x07
/** @defgroup adc_seqr1_usch6 USCH6 User Sequence Number 6
@{*/
/**@}*/


#define ADC_SEQR1_USCH5_SHIFT		16
#define ADC_SEQR1_USCH5_MASK		0x07
/** @defgroup adc_seqr1_usch5 USCH5 User Sequence Number 5
@{*/
/**@}*/


#define ADC_SEQR1_USCH4_SHIFT		12
#define ADC_SEQR1_USCH4_MASK		0x07
/** @defgroup adc_seqr1_usch4 USCH4 User Sequence Number 4
@{*/
/**@}*/


#define ADC_SEQR1_USCH3_SHIFT		8
#define ADC_SEQR1_USCH3_MASK		0x07
/** @defgroup adc_seqr1_usch3 USCH3 User Sequence Number 3
@{*/
/**@}*/


#define ADC_SEQR1_USCH2_SHIFT		4
#define ADC_SEQR1_USCH2_MASK		0x07
/** @defgroup adc_seqr1_usch2 USCH2 User Sequence Number 2
@{*/
/**@}*/


#define ADC_SEQR1_USCH1_SHIFT		0
#define ADC_SEQR1_USCH1_MASK		0x07
/** @defgroup adc_seqr1_usch1 USCH1 User Sequence Number 1
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_seqr2 SEQR2 Channel Sequence Register 2
@{*/


#define ADC_SEQR2_USCH16_SHIFT		28
#define ADC_SEQR2_USCH16_MASK		0x07
/** @defgroup adc_seqr2_usch16 USCH16 User Sequence Number 16
@{*/
/**@}*/


#define ADC_SEQR2_USCH15_SHIFT		24
#define ADC_SEQR2_USCH15_MASK		0x07
/** @defgroup adc_seqr2_usch15 USCH15 User Sequence Number 15
@{*/
/**@}*/


