grevaillot/svd_tools/headers/ATSAM4SP32A/adc.h
#define ADC_SEQR2_USCH14_SHIFT		20
#define ADC_SEQR2_USCH14_MASK		0x07
/** @defgroup adc_seqr2_usch14 USCH14 User Sequence Number 14
@{*/
/**@}*/


#define ADC_SEQR2_USCH13_SHIFT		16
#define ADC_SEQR2_USCH13_MASK		0x07
/** @defgroup adc_seqr2_usch13 USCH13 User Sequence Number 13
@{*/
/**@}*/


#define ADC_SEQR2_USCH12_SHIFT		12
#define ADC_SEQR2_USCH12_MASK		0x07
/** @defgroup adc_seqr2_usch12 USCH12 User Sequence Number 12
@{*/
/**@}*/


#define ADC_SEQR2_USCH11_SHIFT		8
#define ADC_SEQR2_USCH11_MASK		0x07
/** @defgroup adc_seqr2_usch11 USCH11 User Sequence Number 11
@{*/
/**@}*/


#define ADC_SEQR2_USCH10_SHIFT		4
#define ADC_SEQR2_USCH10_MASK		0x07
/** @defgroup adc_seqr2_usch10 USCH10 User Sequence Number 10
@{*/
/**@}*/


#define ADC_SEQR2_USCH9_SHIFT		0
#define ADC_SEQR2_USCH9_MASK		0x07
/** @defgroup adc_seqr2_usch9 USCH9 User Sequence Number 9
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cher CHER Channel Enable Register
@{*/

/** ADC_CHER_CH9 Channel 9 Enable **/
#define ADC_CHER_CH9		(1 << 9)
/** ADC_CHER_CH8 Channel 8 Enable **/
#define ADC_CHER_CH8		(1 << 8)
/** ADC_CHER_CH7 Channel 7 Enable **/
#define ADC_CHER_CH7		(1 << 7)
/** ADC_CHER_CH6 Channel 6 Enable **/
#define ADC_CHER_CH6		(1 << 6)
/** ADC_CHER_CH5 Channel 5 Enable **/
#define ADC_CHER_CH5		(1 << 5)
/** ADC_CHER_CH4 Channel 4 Enable **/
#define ADC_CHER_CH4		(1 << 4)
/** ADC_CHER_CH3 Channel 3 Enable **/
#define ADC_CHER_CH3		(1 << 3)
/** ADC_CHER_CH2 Channel 2 Enable **/
#define ADC_CHER_CH2		(1 << 2)
/** ADC_CHER_CH1 Channel 1 Enable **/
#define ADC_CHER_CH1		(1 << 1)
/** ADC_CHER_CH0 Channel 0 Enable **/
#define ADC_CHER_CH0		(1 << 0)

/**@}*/

/** @defgroup adc_chdr CHDR Channel Disable Register
@{*/

/** ADC_CHDR_CH9 Channel 9 Disable **/
#define ADC_CHDR_CH9		(1 << 9)
/** ADC_CHDR_CH8 Channel 8 Disable **/
#define ADC_CHDR_CH8		(1 << 8)
/** ADC_CHDR_CH7 Channel 7 Disable **/
#define ADC_CHDR_CH7		(1 << 7)
/** ADC_CHDR_CH6 Channel 6 Disable **/
#define ADC_CHDR_CH6		(1 << 6)
/** ADC_CHDR_CH5 Channel 5 Disable **/
#define ADC_CHDR_CH5		(1 << 5)
/** ADC_CHDR_CH4 Channel 4 Disable **/
#define ADC_CHDR_CH4		(1 << 4)
/** ADC_CHDR_CH3 Channel 3 Disable **/
#define ADC_CHDR_CH3		(1 << 3)
/** ADC_CHDR_CH2 Channel 2 Disable **/
#define ADC_CHDR_CH2		(1 << 2)
/** ADC_CHDR_CH1 Channel 1 Disable **/
#define ADC_CHDR_CH1		(1 << 1)
/** ADC_CHDR_CH0 Channel 0 Disable **/
#define ADC_CHDR_CH0		(1 << 0)

/**@}*/

/** @defgroup adc_chsr CHSR Channel Status Register
@{*/

/** ADC_CHSR_CH9 Channel 9 Status **/
#define ADC_CHSR_CH9		(1 << 9)
/** ADC_CHSR_CH8 Channel 8 Status **/
#define ADC_CHSR_CH8		(1 << 8)
/** ADC_CHSR_CH7 Channel 7 Status **/
#define ADC_CHSR_CH7		(1 << 7)
/** ADC_CHSR_CH6 Channel 6 Status **/
#define ADC_CHSR_CH6		(1 << 6)
/** ADC_CHSR_CH5 Channel 5 Status **/
#define ADC_CHSR_CH5		(1 << 5)
/** ADC_CHSR_CH4 Channel 4 Status **/
#define ADC_CHSR_CH4		(1 << 4)
/** ADC_CHSR_CH3 Channel 3 Status **/
#define ADC_CHSR_CH3		(1 << 3)
/** ADC_CHSR_CH2 Channel 2 Status **/
#define ADC_CHSR_CH2		(1 << 2)
/** ADC_CHSR_CH1 Channel 1 Status **/
#define ADC_CHSR_CH1		(1 << 1)
/** ADC_CHSR_CH0 Channel 0 Status **/
#define ADC_CHSR_CH0		(1 << 0)

/**@}*/

/** @defgroup adc_lcdr LCDR Last Converted Data Register
@{*/


#define ADC_LCDR_CHNB_SHIFT		12
#define ADC_LCDR_CHNB_MASK		0x0f
/** @defgroup adc_lcdr_chnb CHNB Channel Number
@{*/
/**@}*/


#define ADC_LCDR_LDATA_SHIFT		0
#define ADC_LCDR_LDATA_MASK		0xfff
/** @defgroup adc_lcdr_ldata LDATA Last Data Converted
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_ier IER Interrupt Enable Register
@{*/

/** ADC_IER_RXBUFF Receive Buffer Full Interrupt Enable **/
#define ADC_IER_RXBUFF		(1 << 28)
/** ADC_IER_ENDRX End of Receive Buffer Interrupt Enable **/
#define ADC_IER_ENDRX		(1 << 27)
/** ADC_IER_COMPE Comparison Event Interrupt Enable **/
#define ADC_IER_COMPE		(1 << 26)
/** ADC_IER_GOVRE General Overrun Error Interrupt Enable **/
#define ADC_IER_GOVRE		(1 << 25)
/** ADC_IER_DRDY Data Ready Interrupt Enable **/
#define ADC_IER_DRDY		(1 << 24)
/** ADC_IER_EOCAL End of Calibration Sequence **/
#define ADC_IER_EOCAL		(1 << 23)
/** ADC_IER_EOC9 End of Conversion Interrupt Enable 9 **/
#define ADC_IER_EOC9		(1 << 9)
/** ADC_IER_EOC8 End of Conversion Interrupt Enable 8 **/
#define ADC_IER_EOC8		(1 << 8)
/** ADC_IER_EOC7 End of Conversion Interrupt Enable 7 **/
#define ADC_IER_EOC7		(1 << 7)
/** ADC_IER_EOC6 End of Conversion Interrupt Enable 6 **/
#define ADC_IER_EOC6		(1 << 6)
/** ADC_IER_EOC5 End of Conversion Interrupt Enable 5 **/
#define ADC_IER_EOC5		(1 << 5)
/** ADC_IER_EOC4 End of Conversion Interrupt Enable 4 **/
#define ADC_IER_EOC4		(1 << 4)
/** ADC_IER_EOC3 End of Conversion Interrupt Enable 3 **/
#define ADC_IER_EOC3		(1 << 3)
/** ADC_IER_EOC2 End of Conversion Interrupt Enable 2 **/
#define ADC_IER_EOC2		(1 << 2)
/** ADC_IER_EOC1 End of Conversion Interrupt Enable 1 **/
#define ADC_IER_EOC1		(1 << 1)
/** ADC_IER_EOC0 End of Conversion Interrupt Enable 0 **/
#define ADC_IER_EOC0		(1 << 0)

/**@}*/

/** @defgroup adc_idr IDR Interrupt Disable Register
@{*/

/** ADC_IDR_RXBUFF Receive Buffer Full Interrupt Disable **/
#define ADC_IDR_RXBUFF		(1 << 28)
/** ADC_IDR_ENDRX End of Receive Buffer Interrupt Disable **/
#define ADC_IDR_ENDRX		(1 << 27)
/** ADC_IDR_COMPE Comparison Event Interrupt Disable **/
#define ADC_IDR_COMPE		(1 << 26)
/** ADC_IDR_GOVRE General Overrun Error Interrupt Disable **/
#define ADC_IDR_GOVRE		(1 << 25)
/** ADC_IDR_DRDY Data Ready Interrupt Disable **/
#define ADC_IDR_DRDY		(1 << 24)
/** ADC_IDR_EOCAL End of Calibration Sequence **/
#define ADC_IDR_EOCAL		(1 << 23)
/** ADC_IDR_EOC9 End of Conversion Interrupt Disable 9 **/
#define ADC_IDR_EOC9		(1 << 9)
/** ADC_IDR_EOC8 End of Conversion Interrupt Disable 8 **/
#define ADC_IDR_EOC8		(1 << 8)
/** ADC_IDR_EOC7 End of Conversion Interrupt Disable 7 **/
#define ADC_IDR_EOC7		(1 << 7)
/** ADC_IDR_EOC6 End of Conversion Interrupt Disable 6 **/
#define ADC_IDR_EOC6		(1 << 6)
/** ADC_IDR_EOC5 End of Conversion Interrupt Disable 5 **/
#define ADC_IDR_EOC5		(1 << 5)
/** ADC_IDR_EOC4 End of Conversion Interrupt Disable 4 **/
#define ADC_IDR_EOC4		(1 << 4)
/** ADC_IDR_EOC3 End of Conversion Interrupt Disable 3 **/
#define ADC_IDR_EOC3		(1 << 3)
/** ADC_IDR_EOC2 End of Conversion Interrupt Disable 2 **/
#define ADC_IDR_EOC2		(1 << 2)
/** ADC_IDR_EOC1 End of Conversion Interrupt Disable 1 **/
#define ADC_IDR_EOC1		(1 << 1)
/** ADC_IDR_EOC0 End of Conversion Interrupt Disable 0 **/
#define ADC_IDR_EOC0		(1 << 0)

/**@}*/

/** @defgroup adc_imr IMR Interrupt Mask Register
@{*/

/** ADC_IMR_RXBUFF Receive Buffer Full Interrupt Mask **/
#define ADC_IMR_RXBUFF		(1 << 28)
/** ADC_IMR_ENDRX End of Receive Buffer Interrupt Mask **/
#define ADC_IMR_ENDRX		(1 << 27)
/** ADC_IMR_COMPE Comparison Event Interrupt Mask **/
#define ADC_IMR_COMPE		(1 << 26)
/** ADC_IMR_GOVRE General Overrun Error Interrupt Mask **/
#define ADC_IMR_GOVRE		(1 << 25)
/** ADC_IMR_DRDY Data Ready Interrupt Mask **/
#define ADC_IMR_DRDY		(1 << 24)
/** ADC_IMR_EOCAL End of Calibration Sequence **/
#define ADC_IMR_EOCAL		(1 << 23)
/** ADC_IMR_EOC9 End of Conversion Interrupt Mask 9 **/
#define ADC_IMR_EOC9		(1 << 9)
/** ADC_IMR_EOC8 End of Conversion Interrupt Mask 8 **/
#define ADC_IMR_EOC8		(1 << 8)
/** ADC_IMR_EOC7 End of Conversion Interrupt Mask 7 **/
#define ADC_IMR_EOC7		(1 << 7)
/** ADC_IMR_EOC6 End of Conversion Interrupt Mask 6 **/
#define ADC_IMR_EOC6		(1 << 6)
/** ADC_IMR_EOC5 End of Conversion Interrupt Mask 5 **/
#define ADC_IMR_EOC5		(1 << 5)
/** ADC_IMR_EOC4 End of Conversion Interrupt Mask 4 **/
#define ADC_IMR_EOC4		(1 << 4)
/** ADC_IMR_EOC3 End of Conversion Interrupt Mask 3 **/
#define ADC_IMR_EOC3		(1 << 3)
/** ADC_IMR_EOC2 End of Conversion Interrupt Mask 2 **/
#define ADC_IMR_EOC2		(1 << 2)
/** ADC_IMR_EOC1 End of Conversion Interrupt Mask 1 **/
#define ADC_IMR_EOC1		(1 << 1)
/** ADC_IMR_EOC0 End of Conversion Interrupt Mask 0 **/
#define ADC_IMR_EOC0		(1 << 0)

/**@}*/

